app/views/makes/show.html.erb

    <ul>
      <% @make.cars.each do |car| %>
---
SELECT "cars".* FROM "cars" WHERE "cars"."make_id" = ?  [["make_id", 1]]