app/controllers/cars_controller.rb

SELECT "makes".* FROM "makes"
SELECT "parts".* FROM "parts"
---
  def new
    @car = Car.new
    @makes = Make.all
    @parts = Part.all

SELECT "makes".* FROM "makes"
SELECT "parts".* FROM "parts" WHERE 1=0
---
  def edit
    @makes = Make.all
    @parts = Part.all

INSERT INTO "cars" ("model", "make_id", "vin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["model", "SX4"], ["make_id", 1], ["vin", "FGNRGER34343T3GDF"], ["created_at", "2019-09-23 02:43:05.122043"], ["updated_at", "2019-09-23 02:43:05.122043"]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

UPDATE "cars" SET "make_id" = ?, "vin" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["make_id", 2], ["vin", "1GNFK16Z86J156085"], ["updated_at", "2019-10-08 04:08:49.331051"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @car.update(car_params)

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
---
  def destroy
    @car.destroy

SELECT "cars".* FROM "cars" WHERE (model like '%sx4%')
---
  def search
    @cars = Car.where("model like ?", "%#{params[:query]}%")