app/controllers/makes_controller.rb

  def index
    @makes = Make.all
---
SELECT "makes".* FROM "makes"

  def create
    @make = Make.new(make_params)

    respond_to do |format|
      if @make.save
---
INSERT INTO "makes" ("name", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Suzuki"], ["country", "South Korea"], ["created_at", "2019-09-23 02:41:44.316312"], ["updated_at", "2019-09-23 02:41:44.316312"]]

  def destroy
    @make.destroy
---
DELETE FROM "makes" WHERE "makes"."id" = ?  [["id", 4]]

  def search
    @makes = Make.where("name like ?", "%#{params[:query]}%")
---
SELECT "makes".* FROM "makes" WHERE (name like '%suzuki%')

    def set_make
      @make = Make.find(params[:id])
---
SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]