app/controllers/parts_controller.rb

  def index
    @parts = Part.all
---
SELECT "parts".* FROM "parts"

  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save
---
INSERT INTO "parts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Engine"], ["created_at", "2019-09-23 02:40:54.425225"], ["updated_at", "2019-09-23 02:40:54.425225"]]

  def destroy
    @part.destroy
---
DELETE FROM "cars_parts" WHERE "cars_parts"."part_id" = ?  [["part_id", 5]]
DELETE FROM "parts" WHERE "parts"."id" = ?  [["id", 5]]

  def search
    @parts = Part.where("name like ?", "%#{params[:query]}")
---
SELECT "parts".* FROM "parts" WHERE (name like '%engine')

    def set_part
      @part = Part.find(params[:id])
---
SELECT  "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]