app/views/cars/_form.html.erb

    <%= form.label :make_id %>
    <%= form.collection_select(:make_id, Make.all, :id, :name) %>
---
SELECT "makes".* FROM "makes"

    <br>
    <div class="table"><%= form.collection_check_boxes(:part_ids, Part.all, :id, :name) %><br></div>
---
SELECT "parts".* FROM "parts"