app/views/cars/index.html.erb

SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
            <td><%= car.make.name %></td>
            <td><%= car.make.country %></td>