app/views/cars/show.html.erb

SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      <strong>Country of Origin:</strong>
      <%= @car.make.country %>

SELECT "parts".* FROM "parts" INNER JOIN "cars_parts" ON "parts"."id" = "cars_parts"."part_id" WHERE "cars_parts"."car_id" = ?  [["car_id", 7]]
---
    <ul>
      <% @car.parts.each do |part| %>